{
  "users": [
    {
      "email": "kenzinho@mail.com",
      "password": "$2a$10$YQiiz0ANVwIgpOjYXPxc0O9H2XeX3m8OoY1xk7OGgxTnOJnsZU7FO",
      "name": "Kenzinho",
      "id": 1
    },
    {
      "email": "manu@mail.com",
      "password": "$2a$10$YQiiz0ANVwIgpOjYXPxc0O9H2XeX3m8OoY1xk7OGgxTnOJnsZU7FO",
      "name": "Manu",
      "id": 2
    },
    {
      "email": "daniele@mail.com",
      "password": "$2a$10$YQiiz0ANVwIgpOjYXPxc0O9H2XeX3m8OoY1xk7OGgxTnOJnsZU7FO",
      "name": "Daniele",
      "id": 3
    },
    {
      "email": "leonardo@mail.com",
      "password": "$2a$10$YQiiz0ANVwIgpOjYXPxc0O9H2XeX3m8OoY1xk7OGgxTnOJnsZU7FO",
      "name": "Leonardo",
      "id": 4
    },
    {
      "email": "odair@mail.com",
      "password": "$2a$10$YQiiz0ANVwIgpOjYXPxc0O9H2XeX3m8OoY1xk7OGgxTnOJnsZU7FO",
      "name": "Odair",
      "id": 5
    }
  ],
  "recipes": [
    {
      "id": 1,
      "image": "https://i.pinimg.com/736x/25/82/59/2582593863dbcc59e7523bc32ad688fb.jpg",
      "title": "Salada Coleslaw",
      "ingredients": ["250 g de repolho verde", "250 g de repolho roxo", "150 g de cenoura", "60 g de maionese", "36 g de mostarda tipo Dijon", "10 g de vinagre de maçã", "5 g de molho de pimenta", "Sal e pimenta a gosto"],
      "directions": "Primeiramente, retire as folhas externas e danificadas. Em seguida, com o auxílio de uma faca afiada, corte o repolho/couve ao meio e remova o núcleo rígido. com o auxílio de uma faca afiada, pique os repolhos/couves em fatias finas, entre 3 a 5 mm. É possível utilizar o mandolin para cortar os repolhos em fatias bem finas. após fatiar os repolhos/couves, lave em água corrente e seque com o auxílio de uma centrífuga de salada. em uma tigela grande, coloque a cenoura ralada e os repolhos/couves fatiados. em uma tigela pequena, coloque a maionese, a mostarda, o vinagre de maçã ou sidra e o molho de pimenta (opcional). Bata com um batedor/fouet, até que se forme uma mistura homogênea. adicione o molho na mistura de vegetais e mexa bem, até que todos os vegetais estejam cobertos pelo molho. Em seguida, adicione a pimenta-do-reino/pimenta-preta e o sal a gosto. Por fim, cubra com plástico filme e leve para refrigerar, por no mínimo 1 hora. retire da refrigeração e sirva com frango assado, frito ou carne grelhada.",
      "userId": 5      
    },
    {
      "id": 2,
      "image": "https://www.vaisefood.com/wp-content/uploads/2014/09/Side_Salada-Ni%C3%A7oise-com-Atum-fresco-mi-cuit_Felipe-Gombossy.jpg",
      "title": "Salada Niçoise",
      "ingredients": ["1 lata de atum em conserva", "1 maço de alface lisa", "200 g de vagem", "2 tomates", "2 ovos", "2 batatas", "1/4 de pimentão verde", "1/4 de pimentão vermelho", "1/4 de pimentão amarelo", "6 filés de anchovas em conserva", "2 colheres (sopa) de azeitonas verdes", "1 colher (sopa) de salsinha picada", "1 colher (sopa) de mostarda de Dijon", "2 colheres (sopa) de vinagre de vinho branco", "5 colheres (sopa) de azeite", "Sal e pimenta a gosto"],
      "directions": "Lave bem as folhas de alface sob água corrente, transfira as folhas de rúcula para uma tigela com 1 litro de água e um bactericida da sua escolha. Deixe de molho por 15 minutos. Retire as folhas, em vez de escorrer - assim as sujeirinhas ficam no fundo da tigela - enxague e seque bem. Numa panela média, coloque 1 litro de água com 1 colher (sopa) de sal e leve ao fogo alto. Quando ferver, acrescente as vagens e deixe cozinhar por 5 minutos. Prepare uma tigela com água e gelo. Com uma escumadeira, retire as vagens da panela e transfira para a tigela, isso serve para cessar o cozimento. Quando esfriar, escorra. Faça um corte em X na base de cada tomate. Na panela onde as vagens foram cozidas, coloque os tomates por alguns segundos. Prepare outra tigela com água e gelo. Retire os tomates da panela e mergulhe-os na tigela. Pelo X, puxe a pele como se fossem quatro folhas. O choque térmico faz com que a pele se desprenda facilmente. Corte os tomates em quatro e retire as sementes. Numa panela, cubra os ovos com água e leve ao fogo alto. Quando ferver, abaixe o fogo e deixe cozinhar por 7 minutos. Retire do fogo e deixe esfriar. Descasque os ovos e corte-os em rodelas. Descasque as batatas e corte em rodelas de 0,5 cm de espessura. Leve uma panela com 1 litro de água ao fogo alto. Quando ferver, coloque as batatas e deixe cozinhar por 3 minutos. Corte os pimentões na metade no sentido do comprimento e retire as sementes com as mãos. Corte ¼ de cada pimentão em tirinhas de 1 cm de espessura. Arrume as folhas de alface numa travessa. Disponha os filés de anchovas, as azeitonas e todos os outros ingredientes de maneira harmoniosa. Salpique com a salsinha e regue com o molho. Sirva a seguir. Numa tigela, coloque a mostarda e o vinagre. Bata com um garfinho, enquanto acrescenta o azeite aos poucos. Tempere com sal e pimenta-do-reino.",
      "userId": 3      
    },
    {
      "id": 3,
      "image": "https://cadareceita.com.br/wp-content/uploads/2020/08/saladagrega-freepik-500x477.jpg",
      "title": "Salada Grega",
      "ingredients": ["150 gramas de queijo feta","350 gramas de pepino", "140 gramas de cebola roxa", "450 gramas de tomate", "100 gramas de pimentão verde", "50 gramas de azeitonas", "1 colher de chá de orégano", "4 colheres de sopa de azeite de oliva", "Sal e pimenta a gosto"],
      "directions": "corte a cebola em tiras finas; se preferir, deixe-as mergulhadas em água por 5-10 minutos pare reduzir a picância; retire-as da água e seque-as com papel absorvente, descasque o pepino, retire as sementes (opcional) e corte-o em pedaços pequenos, retire o pedículo (parte que liga o tomate ao galho da planta) e corte-o em fatias (6 a 8 fatias). Pimentão (opcional) corte em fatias bem finas coloque, tomate, pepino, cebola, pimentão e azeitonas em uma tigela grande; adicione metade do azeite e metade do orégano e mexa bem oloque pedaços do queijo feta sobre a salada grega e polvilhe com o orégano e com o resto do azeite de oliva; se não encontrar queijo feta, utilize chancliche ou queijo coalho. Adicione sal e pimenta-do-reino",
      "userId": 2      
    },
    {
      "id": 4,
      "image": "https://www.thespruceeats.com/thmb/DRaBINVopeoHOpjJn66Yh7pMBSc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/classic-caesar-salad-recipe-996054-Hero_01-33c94cc8b8e841ee8f2a815816a0af95.jpg",
      "title": "Caesar Salad",
      "ingredients": ["300 g de alface americana", "20 g queijo parmesão", "300 g de tiras de peito de frango", "30 g de croutons", "5 tiras de aliche", "100 ml de azeite extravirgem", "50 g de mostarda amarela"],
      "directions": "Em um liquidificador bata o aliche, a mostarda e o azeite extravirgem até virar um patê. Não é necessário salgar o molho porque o aliche já é temperado. Use pão de sanduíche fatiado. Retire a casca e passe no azeite extravirgem. Leve ao forno para torrar. Retire quando as fatias estiverem douradas. Corte em cubinhos de 7 mm a 10 mm. Tempere as tiras de frango com sal e pimenta a gosto e coloque para grelhar. A dica é: depois de grelhar, retire do fogo com uma colher furada, assim toda a gordura escorre e as tiras ficam bem sequinhas. Depois é necessário higienizar a alface e rasgar em pedaços de aproximadamente 5mm. Em uma tigela espalhe a alface rasgada e as tiras de frango grelhado. Acrescente o queijo parmesão e os croutons. Tempere com o molho à base de azeite extravirgem.",
      "userId": 1      
    },
    {
      "id": 5,
      "image": "https://receidelicia.com.br/wp-content/uploads/2021/02/waldorf-salad.png",
      "title": "Salada Waldorf",
      "ingredients": ["1 Maçã verde", "1 Maçã vermelha", "2 xícaras de talo de salsão picado", "1 xícara de uvas sem caroço cortadas ao meio", "1/4 xícara de nozes", "1 Limão", "1/2 xícara de iogurte natural", "3/4 xícara maionese", "Sal e pimenta a gosto"],
      "directions": "Misture numa tigela o iogurte, a maionese e o caldo de 1/2 limão. Tempere com sal e pimenta-do-reino a gosto. Reserve. Corte as maçãs, descarte as sementes e corte-as em cubos. Transfira para uma tigela e regue com mais limão (evita que as frutas escureçam). Pique as nozes grosseiramente e misture ao molho. Junte as frutas, o salsão, prove e corrija o tempero. Sirva gelado.",
      "userId": 4      
    },
    {
      "id": 6,
      "image": "https://cdn.casaeculinaria.com/wp-content/uploads/2023/02/27105603/Imagem-Destacada.jpg",
      "title": "Salada Caprese",
      "ingredients": ["2 Tomates", "250g de Mussarela de búfala", "15g de azeite de oliva", "5 folhas de manjericão", "1/4 colher de chá de orégano", "sal a gosto"],
      "directions": "Lave e seque os tomates e as folhas de manjerição com muito cuidado. Retire a mussarela da refrigeração 5 minutos antes do ínicio do preparo. Corte os tomates e a mussarela em fatias, em seguida, regue com azeite de oliva e polvilhe o orégano e sal.",
      "userId": 5      
    }
  ],
  "favorites": [
    {
      "recipeId": 1,
      "userId": 3,
      "id": 1
    },
    {
      "recipeId": 2,
      "userId": 1,
      "id": 2
    },
    {
      "recipeId": 3,
      "userId": 2,
      "id": 3
    },
    {
      "recipeId": 4,
      "userId": 5,
      "id": 4
    },
    {
      "recipeId": 5,
      "userId": 4,
      "id": 5
    }
  ]
}